Repository: BravoBaldo/Translations
Catalog: FastLed/FastLED_OmegaT/FastLED_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: Not all LEDs are at full brightness
it_it: Non tutti i LED sono alla massima luminosità

source: Not all LEDs are on at once
it_it: Non tutti i LED sono accesi contemporaneamente

source: Not timing-critical
it_it: Non è critico per il timing

source: Note that the nested list above is preceded
it_it: Si noti che l'elenco nidificato sopra riportato è preceduto

source: Note: back-quotes are not needed if there are no spaces in the name.
it_it: Nota: le virgolette inverse non sono necessarie se il nome non contiene spazi.

source: Note: the section headings in these pages use a different convention than the one presented below.
it_it: Nota: le intestazioni di sezione in queste pagine utilizzano una convenzione diversa da quella presentata di seguito.

source: Notes
it_it: Note

source: Now explore:
it_it: Ora esploriamo:

source: Now that you have a working program:
it_it: Ora che si ha un programma funzionante:

source: Now that you understand basic animations, explore [Chases and Scanners](chases.md) to learn about moving patterns with trail effects.
it_it: Ora che sono state comprese le animazioni di base, esplorare [Sequenze e Scanner](chases) per imparare a usare i pattern in movimento con effetti scia.

source: Now that you understand the basics:
it_it: Ora che sono state capite le basi:

source: Observe which test fails to identify problem
it_it: Osservare quale test non riesce a identificare il problema

source: Ocean Waves
it_it: Onde dell'Oceano

source: Older strip type
it_it: Tipo di strip più vecchio

source: Older, requires clock
it_it: Più vecchio, richiede clock

source: On ESP32, WiFi can interfere.
it_it: Su ESP32, il WiFi può interferire.

source: On Linux:
it_it: Su Linux

source: On memory-constrained devices (Arduino Uno: 2KB RAM), consider:
it_it: Su dispositivi con limiti di memoria (Arduino Uno: 2 KB di RAM), considerare:

source: Once Python is installed
it_it: Una volta installato Python

source: Once you're comfortable with solid colors, move on to [Animations](animations.md) to learn how to create dynamic effects.
it_it: Una volta acquisita familiarità con i colori pieni, passare ad [Animazioni](animations) per imparare a creare effetti dinamici.

source: Once you're comfortable with these basics, move on to [Core Concepts](../core-concepts/) to deepen your understanding.
it_it: Una volta acquisite queste nozioni di base, passare ai [Concetti Fondamentali](../core-concepts/README) per approfondire.

source: One of our firm policies is EVERYTHING MUST BE DOCUMENTED.
it_it: Una delle nostre politiche aziendali è TUTTO DEVE ESSERE DOCUMENTATO.

source: Only First LED Works
it_it: Funziona Solo il Primo LED

source: Only Some LEDs Work
it_it: Funzionano solo alcuni LED

source: Open **Sketch → Include Library → Manage Libraries**
it_it: Aprire **Sketch → Include Library → Manage Libraries**

source: Open Serial Monitor (115200 baud)
it_it: Aprire Serial Monitor (115200 baud)

source: Optimize Noise Functions
it_it: Ottimizzare le funzioni di rumore

source: Optimize Palette Lookups
it_it: Ottimizzare le Ricerche nella Palette

source: Optimize nested loops
it_it: Ottimizzare i loop annidati

source: Optimizing your code ensures high frame rates and responsive effects.
it_it: L'ottimizzazione del codice garantisce frame rate elevati ed effetti reattivi.

source: Optional: MAX4466 or similar microphone amplifier for better sensitivity
it_it: Opzionale: amplificatore per microfono MAX4466 o simile per una migliore sensibilità

source: Or use the heading's text as the link's text:
it_it: Oppure usare il testo dell'intestazione come testo del link:

source: Oranges and reds
it_it: Arancioni e rossi

source: Organic flowing patterns
it_it: Pattern fluidi organici

source: Orient your LED strip vertically with the data input at the bottom for best visual effect
it_it: Orientare la striscia LED verticalmente con l'input dati in basso per un effetto visivo ottimale

source: Other Efficient Functions
it_it: Altre Funzioni Efficienti

source: Other conduct which could reasonably be considered inappropriate in
it_it: Altre condotte che potrebbero ragionevolmente essere considerate inappropriate in

source: Others update serially (Arduino Uno)
it_it: Altri si aggiornano serialmente (Arduino Uno)

source: Our Pledge
it_it: Il nostro Impegno

source: Our Responsibilities
it_it: Le nostre Responsabilità

source: Our Standards
it_it: I Nostri Standard

source: Output range: 0-255 (0 = -1.0, 128 = 0, 255 = +1.0)
it_it: Intervallo di output: 0-255 (0 = -1,0, 128 = 0, 255 = +1,0)

source: Over distance, voltage drops:
it_it: A distanza, cali di tensione:

source: Overview
it_it: Panoramica

source: Pacifica (Ocean Waves)
it_it: Pacifica (Onde dell'Oceano)

source: Palette Animation Techniques
it_it: Tecniche di Animazione della Palette

source: Palette Best Practices
it_it: Palette Migliore Pratiche

source: Palette Blending
it_it: Fusione della Palette

source: Palette animation techniques: moving, stretching, pulsing, and transitioning between palettes
it_it: Tecniche di animazione delle palette: spostamento, allungamento, pulsazione e transizione tra palette

source: Parallel output capability
it_it: Capacità di uscita parallela

source: Parameters
it_it: Parametri

source: Parameters Explained
it_it: Spiegazione dei Parametri

source: Partial Rainbow
it_it: Arcobaleno Parziale

source: Pattern Categories
it_it: Categorie di Pattern

source: Pattern Cross-Fading
it_it: Dissolvenza Incrociata di Pattern

source: Pattern Type
it_it: Tipo di Pattern

source: Pattern-Specific Optimizations
it_it: Ottimizzazioni Specifiche per Pattern

source: Per-Channel Scaling
it_it: Ridimensionamento per Canale

source: Per-LED Fading
it_it: Dissolvenza per singolo LED

source: Per-Section Capacitors
it_it: Condensatori per Sezione

source: Performance
it_it: Prestazioni

source: Performance Comparison
it_it: Confronto delle Prestazioni

source: Performance Considerations
it_it: Considerazioni sulle Prestazioni

source: Performance Optimization
it_it: Ottimizzazione delle Prestazioni

source: Performance Tips
it_it: Suggerimenti per le Prestazioni

source: Performance comparison table rating speed, reliability, cost, ease of use, and availability across popular LED types
it_it: Tabella di confronto delle prestazioni che valuta velocità, affidabilità, costo, facilità d'uso e disponibilità per i tipi di LED più diffusi

source: Performance considerations, memory usage, and troubleshooting for multi-strip setups
it_it: Considerazioni sulle prestazioni, utilizzo della memoria e risoluzione dei problemi per configurazioni multi-striscia

source: Performance optimization
it_it: Ottimizzazione delle Prestazioni

source: Performance optimization techniques for matrix animations
it_it: Tecniche di ottimizzazione delle prestazioni per le animazioni di matrici

source: Perlin noise is a type of gradient noise that creates smooth, natural-looking randomness.
it_it: Il rumore di Perlin è un tipo di rumore gradiente che crea una casualità fluida e dall'aspetto naturale.

source: Phased Breathing
it_it: Respirazione con Fase

source: Pin Configurations by Platform
it_it: Configurazioni Pin per Piattaforma

source: Pin Selection
it_it: Selezione dei Pin

source: Pin limitations and restrictions per platform (boot pins, input-only pins, flash pins)
it_it: Limitazioni e restrizioni dei pin per piattaforma (pin di avvio, pin di solo input, pin flash)

source: Pitfall 1: Too Many Serial Prints
it_it: Insidia 1: Troppe stampe seriali

source: Pitfall 2: Blocking Delays
it_it: Insidia 2: Ritardi bloccanti

source: Pitfall 3: Unnecessary Full Strip Updates
it_it: Insidia 3: Aggiornamenti Full Strip non necessari

source: Place resistor between microcontroller pin and LED strip DATA
it_it: Posizionare una resistenza tra il pin del microcontrollore e la striscia LED DATA

source: Place resistor within 6 inches of microcontroller
it_it: Posizionare la resistenza entro 15 cm dal microcontrollore

source: Plan accordingly:
it_it: Pianificare di conseguenza:

source: Plasma Effect
it_it: Effetto Plasma

source: Platform
it_it: Piattaforma

source: Platform Comparison
it_it: Confronto tra Piattaforme

source: Platform Support
it_it: Supporto Piattaforme

source: Platform-Specific Tips
it_it: Suggerimenti Specifici per Piattaforma

source: Platform-specific optimization tips and profiling techniques
it_it: Suggerimenti di ottimizzazione e tecniche di profilazione specifiche per piattaforma

source: Platform-specific pin recommendations and configurations for FastLED.
it_it: Consigli e configurazioni dei pin specifici per piattaforma per FastLED.

source: Platform-specific pin recommendations and limitations for Arduino, ESP32, Teensy, STM32, and more
it_it: Raccomandazioni e limitazioni dei pin specifiche per piattaforma per Arduino, ESP32, Teensy, STM32 e altro

source: Platform-specific problems (ESP32, etc.)
it_it: Problemi specifici della piattaforma (ESP32, ecc.)

source: PlatformIO (Recommended)
it_it: PlatformIO (Consigliato)

source: PlatformIO provides the best development experience with dependency management, multiple board support, and easy configuration.
it_it: PlatformIO offre la migliore esperienza di sviluppo con gestione delle dipendenze, supporto per più schede e configurazione semplice.

source: Please wrap the text around column 86 or narrower.
it_it: Andare a capo intorno alla colonna 86 o meno.

source: Plenty of RAM (520KB)
it_it: Ampia RAM (520 KB)

source: Poor connection or ground issue
it_it: Connessione scadente o problema di messa a terra

source: Poor connections
it_it: Collegamenti scadenti

source: Poor ground is a very common cause of flickering
it_it: Una messa a terra insufficiente è una causa molto comune di sfarfallìo

source: Popular LED strip types:
it_it: Tipi di strisce LED più diffuse:

source: Position Management
it_it: Gestione della Posizione

source: Position Mapping
it_it: Mappatura della Posizione

source: Potential damage to components
it_it: Potenziali danni ai componenti

source: Power Considerations
it_it: Considerazioni sull'Alimentazione

source: Power Injection
it_it: Iniezione di Potenza

source: Power Injection Example
it_it: Esempio di Iniezione di Potenza

source: Power Management
it_it: Gestione Energetica

source: Power Supply
it_it: Alimentazione

source: Power Supply Capacitor
it_it: Condensatore di Alimentazione

source: Power Supply Selection
it_it: Scelta dell'Alimentatore

source: Power Supply Selection Guide
it_it: Guida alla Selezione dell'Alimentatore

source: Power long LED strips from the microcontroller's 5V pin (max 500mA typically)
it_it: Alimentare lunghe strisce LED dal pin da 5 V del microcontrollore (max 500 mA in genere)

source: Power supplies and LED strips generate heat:
it_it: Alimentatori e strisce LED generano calore:

source: Power supply capacity sufficient (60mA per LED at full white)
it_it: Capacità di alimentazione sufficiente (60 mA per LED a bianco pieno)

source: Power supply directly to LED strip, not through microcontroller
it_it: Alimentare direttamente la striscia LED, non tramite il microcontrollore

source: Power supply insufficient
it_it: Alimentazione insufficiente

source: Power supply overload
it_it: Sovraccarico dell'alimentatore

source: Power supply overload protection activating
it_it: Protezione da sovraccarico dell'alimentatore in corso

source: Power supply selection
it_it: Scelta dell'alimentatore

source: Power supply should feel warm, not hot
it_it: L'alimentatore deve essere caldo, non bollente

source: Power supply voltage correct (5V for most strips)
it_it: Tensione di alimentazione corretta (5 V per la maggior parte delle strisce)

source: Power supply voltage too low
it_it: Tensione di alimentazione troppo bassa

source: Practical Applications
it_it: Applicazioni Pratiche

source: Practical Examples
it_it: Esempi Pratici

source: Predefined Palettes
it_it: Palette Predefinite

source: Prerequisites
it_it: Prerequisiti

source: Problem: First LED Wrong Color
it_it: Problema: Primo LED di Colore Sbagliato

source: Problem: LEDs Don't Turn On
it_it: Problema: i LED Non Si Accendono

source: Problem: LEDs Glitch During WiFi Activity
it_it: Problema: I LED Si Spengono Durante l'Attività WiFi

source: Problem: Random Flickering
it_it: Problema: Sfarfallìo Casuale

source: Problem: Strip Works Partially
it_it: Problema: La Striscia Funziona Parzialmente

source: Profile your effects to find actual bottlenecks
it_it: Profilare gli effetti per individuare i colli di bottiglia effettivi

source: Profiling and Debugging
it_it: Profiling e Debug

source: Project maintainers are responsible for clarifying the standards of acceptable behavior and are expected to take appropriate and fair corrective action in response to any instances of unacceptable behavior.
it_it: I responsabili del progetto sono tenuti a chiarire gli standard di comportamento accettabile e ad adottare misure correttive appropriate ed eque in risposta a qualsiasi caso di comportamento inaccettabile.

source: Project maintainers have the right and responsibility to remove, edit, or reject comments, commits, code, wiki edits, issues, and other contributions that are not aligned to this Code of Conduct, or to ban temporarily or permanently any contributor for other behaviors that they deem inappropriate, threatening, offensive, or harmful.
it_it: I responsabili del progetto hanno il diritto e la responsabilità di rimuovere, modificare o rifiutare commenti, commit, codice, modifiche al wiki, problemi e altri contributi che non siano in linea con questo Codice di Condotta, o di bannare temporaneamente o permanentemente qualsiasi collaboratore per altri comportamenti che ritengono inappropriati, minacciosi, offensivi o dannosi.

source: Project maintainers who do not follow or enforce the Code of Conduct in good faith may face temporary or permanent repercussions as determined by other members of the project\'s leadership.
it_it: I responsabili del progetto che non rispettano o non applicano il Codice di Condotta in buona fede potrebbero subire ripercussioni temporanee o permanenti, come stabilito dagli altri membri della dirigenza del progetto.

source: Protects against power spikes during LED updates
it_it: Proteggere dai picchi di potenza durante gli aggiornamenti dei LED

source: Protects both microcontroller and LED
it_it: Protegge sia il microcontrollore che il LED

source: Providing Links to API Pages
it_it: Fornire Link alle Pagine API

source: Public or private harassment
it_it: Molestie pubbliche o private

source: Publishing others\' private information, such as a physical or
it_it: Pubblicare informazioni private altrui, come un indirizzo fisico o

source: Quadratic Easing
it_it: Facilitazione Quadratica

source: Quick Navigation
it_it: Navigazione Rapida

source: Quick Start
it_it: Avvio Rapido

source: Quick Troubleshooting Checklist
it_it: Checklist Rapida per la Risoluzione dei Problemi

source: Quick code snippets for common operations (setup, colors, array operations)
it_it: Brevi frammenti di codice per operazioni comuni (configurazione, colori, operazioni array)

source: Quick copy-paste syntax for common operations
it_it: Sintassi rapida per "copia e incolla" per le operazioni comuni

source: Quick fixes for the most frequently encountered problems:
it_it: Soluzioni rapide per i problemi più frequenti:

source: Quick flashing sparkles on a dark background:
it_it: Luccichii rapidi e lampeggianti su sfondo scuro:

source: Quick reference guide for the most frequently encountered FastLED problems and their solutions.
it_it: Guida di riferimento rapido per i problemi FastLED più frequenti e le relative soluzioni.

source: Quick reference guides and configuration tables.
it_it: Guide di riferimento rapido e tabelle di configurazione.

source: Quick solutions for power and wiring issues that affect 80% of LED problems
it_it: Soluzioni rapide per problemi di alimentazione e cablaggio che interessano l'80% dei problemi dei LED

source: RGB (Red, Green, Blue) uses three channels from 0-255:
it_it: RGB (Rosso, Verde, Blu) utilizza tre canali da 0 a 255:

source: RGB (Red, Green, Blue) uses three channels, each ranging from 0-255.
it_it: RGB (Rosso, Verde, Blu) utilizza tre canali, ciascuno con valori compresi tra 0 e 255.

source: RGB Color Model
it_it: Modello di Colore RGB

source: RGB Colors
it_it: Colori RGB

source: RGB and HSV color models
it_it: Modelli di colore RGB e HSV

source: RGB is ideal when:
it_it: RGB è ideale quando:

source: RGB rainbow requires complex calculations:
it_it: L'arcobaleno RGB richiede calcoli complessi:

source: RGB to HSV (Manual)
it_it: Da RGB a HSV (manuale)

source: RGBW variant available (adds white channel)
it_it: Disponibile variante RGBW (aggiunge il canale bianco)

source: RGBW variants available
it_it: Varianti RGBW disponibili

source: Rainbow
it_it: Arcobaleno

source: Rainbow Effects
it_it: Effetti Arcobaleno

source: Rainbow Noise
it_it: Rumore Arcobaleno

source: Rainbow effects showcase the power of HSV color space for creating smooth, natural color transitions.
it_it: Gli effetti arcobaleno mettono in mostra la potenza dello spazio colore HSV per creare transizioni di colore fluide e naturali.

source: Rainbow effects using HSV color space for easy color cycling
it_it: Effetti arcobaleno che utilizzano lo spazio colore HSV per un semplice ciclo di colori

source: Random Colors at Power On
it_it: Colori Casuali all'Accensione

source: Random Flickering
it_it: Sfarfallìo Casuale

source: Random Functions
it_it: Funzioni Random

source: Random LED behavior
it_it: Comportamento casuale dei LED

source: Random twinkling stars and sparkle effects.
it_it: Stelle scintillanti casuali ed effetti di luccichìo.

source: Read [Hardware Requirements](hardware.md) to ensure you have the right components
it_it: Leggere [Requisiti Hardware](hardware) per assicurarti di avere i componenti giusti

source: Read actual current draw
it_it: Leggere l'assorbimento di corrente effettivo

source: Read the header comment in build.py for detailed documentation on each option.
it_it: Per una documentazione dettagliata su ciascuna opzione, leggere il commento dell'intestazione in build.py.

source: Reading Audio Levels
it_it: Lettura dei Livelli Audio

source: Real-World Power Usage
it_it: Consumo Energetico Reale

source: Realistic fire simulation using heat array and color palette.
it_it: Simulazione realistica di incendi utilizzando array di calore e palette di colori.

source: Recommended Supply
it_it: Alimentazione Consigliata

source: Recommended Wiring Diagram
it_it: Schema Elettrico Consigliato

source: Recommended data pins for Arduino Uno, Mega, ESP32, ESP8266, Teensy, STM32, and RP2040
it_it: Pin dati consigliati per Arduino Uno, Mega, ESP32, ESP8266, Teensy, STM32 e RP2040

source: Recommended: [Intermediate Techniques](../intermediate/) - For deeper understanding of techniques used in recipes
it_it: Consigliato: [Tecniche Intermedie](../intermediate/README) - Per una comprensione più approfondita delle tecniche utilizzate nelle ricette

source: Reduce Calculations in Loop
it_it: Ridurre i Calcoli in Loop

source: Reduce LED Count
it_it: Ridurre il Numero di LED

source: Reduce matrix resolution
it_it: Ridurre la risoluzione della matrice

source: Reduces effective resistance by half
it_it: Riduce la resistenza effettiva della metà

source: Reducing Power Draw
it_it: Riduzione del Consumo Energetico

source: Reference the link (anchor) by:
it_it: Fare riferimento al link (àncora) tramite:

source: Referencing API Documentation
it_it: Riferimento alla Documentazione API

source: Related Examples
it_it: Esempi Correlati

source: Related Resources
it_it: Risorse Correlate

source: Reliability
it_it: Affidabilità

source: Remember that LED matrices can have different origin points:
it_it: Ricordare che le matrici LED possono avere punti di origine diversi:

source: Remove `while (!Serial)` for non-USB boards (it will hang)
it_it: Rimuovere `while (!Serial)` per le schede non USB (si bloccherà)

source: Representation of a project may be further defined and clarified by project maintainers.
it_it: La rappresentanza di un progetto può essere ulteriormente definita e chiarita dai responsabili del progetto.

source: Required for 3.3V microcontrollers (ESP8266, some ESP32 boards)
it_it: Necessario per i 3,3 V dei Microcontrollori (ESP8266, alcune schede ESP32)

source: Required for ESP8266, some ESP32 boards
it_it: Necessario per ESP8266, alcune schede ESP32

source: Requires 2 wires (data + clock)
it_it: Richiede 2 fili (dati + clock)

source: Requires conditional logic in XY function
it_it: Richiede logica condizionale nella funzione XY

source: Requires more wiring
it_it: Richiede più cavi

source: Resistor close to microcontroller
it_it: Resistenza vicino al microcontrollore

source: Resistor should be physically close to microcontroller
it_it: La resistenza deve essere fisicamente vicina al microcontrollore

source: Restart Arduino IDE
it_it: Riavviare l'IDE Arduino.

source: Result: "Click My Heading for more details."
it_it: Risultato: "Cliccare My Heading per maggiori dettagli.."

source: Result: "Click here for more details."
it_it: Risultato: "Cliccare qui per maggiori dettagli."

source: Result: "The temperature outside is 20°C."
it_it: Risultato: "La temperatura esterna è di 20°C."

source: Reverse Direction
it_it: Direzione Inversa

source: Review the main [FastLED documentation](https://fastled.io)
it_it: Consultare la [Documentazione principale di FastLED](https://fastled.io)

source: Review the relevant subsection in this directory
it_it: Consultare la sottosezione pertinente in questa directory

source: Ripple Effect
it_it: Effetto Increspatura

source: Row 0: Left to right (0, 1, 2, ...)
it_it: Riga 0: Da sinistra a destra (0, 1, 2, ...)

source: Row 1: Right to left (..., 17, 16, 15)
it_it: Riga 1: Da destra a sinistra (..., 17, 16, 15)

source: Row 2: Left to right (32, 33, 34, ...)
it_it: Riga 2: Da sinistra a destra (32, 33, 34, ...)

source: Rule of Thumb
it_it: Regola Pratica

source: Run LEDs without a shared ground between power supply and microcontroller
it_it: Utilizzare i LED senza una massa condivisa tra alimentatore e microcontrollore

source: Run different effects at different speeds:
it_it: Eseguire effetti diversi a velocità diverse:

source: Run the comprehensive hardware test in [Debugging Tips](debugging.md)
it_it: Eseguire il test hardware completo in [Suggerimenti per il Debug](debugging)

source: Run your pattern
it_it: Eseguire il pattern

source: Running comprehensive test patterns to verify hardware, check color channels, and identify failing LEDs
it_it: Esecuzione di pattern di test completi per verificare l'hardware, controllare i canali colore e identificare i LED difettosi

source: Safe LED Count
it_it: Conteggio Sicuro dei LED

source: Safety Considerations
it_it: Considerazioni sulla Sicurezza

source: Saturation Effects
it_it: Effetti di Saturazione

source: Saturation Math
it_it: Saturazione Matematica

source: Saturation controls color intensity:
it_it: La saturazione controlla l'intensità del colore:

source: Saves wire and simplifies physical layout
it_it: Risparmia i fili e semplifica il layout fisico

source: Sawtooth wave that increases from 0 to 255:
it_it: Onda a dente di sega che aumenta da 0 a 255:

source: Scale Brightness
it_it: Luminosità Scalata

source: Scale Up Gradually
it_it: Aumentare Gradualmente

source: Scale effects to your LED count by adjusting loop ranges
it_it: Adattare gli effetti al numero di LED regolando gli intervalli di loop

source: Scale in-place (modifies the original):
it_it: Scala sul posto (modifica l'originale):
